package lesson1;
/*
    ДЗ
    Напишіть програму, яка в методі main оголошує такі змінні:
    name типу String,
    age типу int,
    city типу String.
    Написати програму, що виводить на екран рік народження мого друга.
    Наразі 2022 рік. Мій друг народився 18 років тому.

    Вимоги:
    1. Програма повинна виводити текст.
    2. Виведений рік повинен складатися з 4 цифр.

     */

public class Friend {
    
    public static void main(String[] args) {

        String name = "Георгій";
        int age = 18;
        String city = "Ізюм";


        System.out.println("Мого друга звати " + name +  "\nРік його народження = " + (2022 - age) + "\nРідне місто - " + city);


    }

}
