package lesson5;

public class Human {

    /*
Створіть клас, що описує людину (створіть метод, що виводить інформацію про людину).
На його основі створіть клас студент з полями (айді, ім'я, прізвище, факультет, рейтинг (середній бал), рік вступу) (перевизначте метод виведення інформації).
Створіть клас “група” який містить масив із 10 об'єктів класу студент.
Реалізуйте методи додавання/видалення студента та метод пошуку студента за прізвищем.
Визначте метод toString() для класу студент щоб він виводив ім'я та прізвище та середній бал у форматі ( Студент Петренко Олексій, рейтинг - 4,4 )

Додатково можна зробити ( Визначте метод toString() для групи так, щоб він виводив список студентів в алфавітному порядку.)
 */

    public String name;
    public String surname;

    public Human (String name, String surname){

        this.name = name;
        this.surname = surname;

    }

public void humanInfo () {
    System.out.println(name +  "  " +  surname);
 }


}
